app/controllers/api/v1/dishes_controller.rb

  def index
    render json: Dish.all
---
SELECT "dishes".* FROM "dishes"