app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.all

    if params[:search]
      @dishes = Dish.search(params[:search].downcase)
      if @dishes.empty?
---
SELECT "dishes".* FROM "dishes" WHERE (name ILIKE '%eggs%' OR description ILIKE '%eggs%')
SELECT COUNT(*) FROM "dishes" WHERE (name ILIKE '%eggs%' OR description ILIKE '%eggs%')

  def show
    @id = params[:id]
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @dish = Dish.new(dish_params)
    @creator = current_user
    @dish.creator = @creator
    if @dish.save
---
INSERT INTO "dishes" ("creator_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["creator_id", 1], ["name", "eggs"], ["description", "eggy"], ["created_at", 2017-01-20 15:36:58 UTC], ["updated_at", 2017-01-20 15:36:58 UTC]]

  def edit
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @dish = Dish.find(params[:id])
    @reviews = @dish.reviews
    if current_user.admin? || (current_user == @dish.creator)
      @dish.destroy
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 2]]