app/controllers/reviews_controller.rb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @review = Review.new
    @dish = Dish.find(params[:dish_id])

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("dish_id", "reviewer_id", "rating", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["dish_id", 1], ["reviewer_id", 1], ["rating", 2], ["body", "boooooooooooooring"], ["created_at", 2017-01-25 14:32:37 UTC], ["updated_at", 2017-01-25 14:32:37 UTC]]
---
  def create
    @dish = Dish.find(params[:dish_id])
    @reviewer = current_user
    @review = Review.new(review_params)
    @review.reviewer_id = @reviewer.id
    if @review.save

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
  def destroy
    @dish = Dish.find(params[:dish_id])
    @review = Review.find(params[:id])
    if current_user.admin? || (current_user == @review.reviewer)
      @review.destroy