app/controllers/votes_controller.rb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def create
    @vote = Vote.new
    @review = Review.find(params[:review_id])
    @dish = Dish.find(params[:dish_id])