app/controllers/votes_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = 1 AND "votes"."review_id" = 6 ORDER BY "votes"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."review_id" = $1  [["review_id", 6]]
INSERT INTO "votes" ("review_id", "user_id", "created_at", "updated_at", "value") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["review_id", 1], ["user_id", 1], ["created_at", 2017-01-25 14:32:39 UTC], ["updated_at", 2017-01-25 14:32:39 UTC], ["value", 1]]
UPDATE "reviews" SET "sum_votes" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["sum_votes", 1], ["updated_at", 2017-01-25 00:58:00 UTC], ["id", 6]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", 1], ["updated_at", 2017-01-25 00:58:00 UTC], ["id", 6]]
---
  def create
    @review = Review.find(params[:review_id])
    @value = params[:value]
    @vote = Vote.where(user: current_user, review: @review).first

    if @vote.nil?
      @vote = Vote.new(review: @review, value: @value)
      @vote.user = current_user
    elsif @vote.value == params[:value].to_i
      @vote.value = 0
    else
      @vote.value = params[:value].to_i
    end

    if @vote.save